[
  {
    "url": "src/Lleiniog_castle/COVER_IMAGE.jpg",
    "cardTitle":"Lleiniog Castle",
    "caption": "Nestled in woodland near the Menai Strait, this 11th-century Norman motte-and-bailey castle once played a key role in Welsh history. Though now in ruins, the site offers a peaceful walk and scenic views of the surrounding landscape.",
    "pageUrl": "Aberlleiniog_castle.html"
  },
  {
    "url": "src/Penmon_point/20250208_140043.jpg",
    "cardTitle":"Penmon Point",
    "caption": "A stunning coastal spot on Anglesey’s eastern edge, offering breathtaking views of Puffin Island and the Great Orme. With its historic lighthouse, rocky shoreline, and abundant wildlife, it’s a perfect place for a scenic walk or quiet reflection.",
    "pageUrl": "Penmon_Point.html"
  },
  {
    "url": "src/Gors_Bodeilio/20250207_145247.jpg",
    "cardTitle":"Gors Bodeilio",
    "caption": "A tranquil wetland nature reserve filled with rare plants, dragonflies, and wading birds. This hidden gem offers peaceful walks through reedbeds and marshy grasslands, changing beautifully with the seasons and attracting nature lovers year-round.",
    "pageUrl": "Gors_Bodeilio.html"
  },
  {
    "url": "src/Niwbrogh/IMG-20250326-WA0002.jpg",
    "cardTitle":"Newborough Forest",
    "caption": "A vast coastal pine forest home to red squirrels, scenic trails, and sandy beaches. It leads to Llanddwyn Island, rich in Welsh legends, offering breathtaking views of Snowdonia and a perfect mix of woodland and seaside beauty.",
    "pageUrl": "Newborough_Forest.html"
  },
  {
    "url": "src/red_wharf/IMG-20250326-WA0001.jpg",
    "cardTitle":"Red Wharf Bay",
    "caption": "A vast tidal bay with golden sands, calm waters, and a rich history of shipwrecks and smugglers. It’s a haven for wildlife, with charming seaside pubs nearby offering stunning views and a peaceful coastal escape.",
    "pageUrl": "Red_Wharf_Bay.html"
  },
   {
    "url": "src/Parys_mountain/Parys_mountain.jpg",
    "cardTitle":"Parys Mountain",
    "caption": "A dramatic, multi-colored landscape shaped by centuries of copper mining. With its Mars-like terrain, old mining ruins, and scenic trails, it’s a fascinating mix of industrial heritage and natural beauty, perfect for exploration.",
    "pageUrl": "Parys_Mountain.html"
  }


]



    

           

        
                